fio-test/results/rand_read_out_16/1024k-libaio.out
job1: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=25317: Thu Jun 13 23:48:28 2024
  read: IOPS=1757, BW=1757MiB/s (1843MB/s)(160GiB/93231msec)
    slat (usec): min=149, max=2986, avg=567.30, stdev=353.21
    clat (usec): min=2, max=377485, avg=144803.38, stdev=53838.54
     lat (usec): min=215, max=379749, avg=145370.87, stdev=54048.90
    clat percentiles (msec):
     |  1.00th=[   63],  5.00th=[   72], 10.00th=[   79], 20.00th=[   92],
     | 30.00th=[  108], 40.00th=[  127], 50.00th=[  144], 60.00th=[  159],
     | 70.00th=[  174], 80.00th=[  188], 90.00th=[  209], 95.00th=[  220],
     | 99.00th=[  313], 99.50th=[  317], 99.90th=[  342], 99.95th=[  355],
     | 99.99th=[  368]
   bw (  MiB/s): min=  194, max= 3924, per=99.70%, avg=1752.09, stdev=683.64, samples=186
   iops        : min=  194, max= 3924, avg=1752.09, stdev=683.64, samples=186
  lat (usec)   : 4=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.02%, 20=0.01%, 50=0.06%
  lat (msec)   : 100=25.86%, 250=70.34%, 500=3.70%
  cpu          : usr=0.31%, sys=51.51%, ctx=86293, majf=0, minf=65565
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=163840,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=1757MiB/s (1843MB/s), 1757MiB/s-1757MiB/s (1843MB/s-1843MB/s), io=160GiB (172GB), run=93231-93231msec

Disk stats (read/write):
    dm-0: ios=86102/0, merge=0/0, ticks=47260/0, in_queue=47260, util=99.33%, aggrios=327332/0, aggrmerge=775260/0, aggrticks=112508/0, aggrin_queue=112508, aggrutil=96.11%
  nvme1n2: ios=327332/0, merge=775260/0, ticks=112441/0, in_queue=112441, util=96.09%
  nvme4n2: ios=327332/0, merge=775260/0, ticks=112142/0, in_queue=112141, util=96.10%
  nvme0n2: ios=327332/0, merge=775260/0, ticks=113083/0, in_queue=113084, util=96.10%
  nvme3n2: ios=327332/0, merge=775260/0, ticks=112572/0, in_queue=112572, util=96.11%
  nvme2n2: ios=327332/0, merge=775260/0, ticks=112305/0, in_queue=112304, util=96.09%